const adviceNum = document.getElementById('adviceNum')
const quote = document.getElementById('quote')
const button = document.getElementById('button')

let quoteCount = 0

let advices = [
`„ადამიანის უძვირფასესი საუნჯე მისი ვინაობაა.“`,

`„ავი კაცი რამდენადაც მეცნიერია, დიდი სწავული, იმოდენად უფრო ძლიერ საშიშია, უფრო ძლიერ მავნებელია.“`,

`„არამც თუ უსაბუთო ძაგება, უსაბუთო ქებაც კი საწყენია მართებულის კაცისათვის.“`,

`„ზოგი საგანია, რომ თუ არ დაინახავ, ვერ ირწმუნებ, და ზოგი – იმისთანა, თუ არ ირწმუნებ, ვერ დაინახავ.“`,

`„მხოლოდ წარსულის ცოდნით დაუცავს ყოველს ერს თავისი ეროვნება, თავისი არსებობა, თავისი ვინაობა.“`,

`„ვინც კარგად ემსახურება სამშობლო ქვეყანას, იგი უდიდგვაროდაც დიდია.“`,

`„აწმყოს, რომელსაც წარსული არ აქვს, არც მომავალი აქვს.“`,

`„ქვეყანა ტაძარი კი არაა, საცა კაცი უნდა ლოცულობდეს, არამედ სახელოსნოა, საცა უნდა ირჯებოდეს და მუშაობდეს!“`,

`„ადამიანის გული თვალუწვდენელი ორმოა.“`,

`„გახსოვდეს, რომ ქვეყანაზე ქაღალდის გარდა არის კიდევ სინდისი.“`,

`„ბედს თვითონ კაცი ქმნის და არა ბედი კაცსა.“`,

`„ქვეყანაზე, რომ ჭირი არ იყოს, ადამიანი ენასაც არ ამოიდგამდა.“`,

`„ქვეყნის სამსახური ყველგან მსხვერპლია და არა სეირი.“`,

`„მეზობლის უბედურებაზე ჩვენი ბედნიერება ვერ დაფუძნდება.“`,

`„ღობე-ყორეს მოდება ღალატია საქმისა.“`,

`„რასაც თვითონ არ ვიმოქმედებთო, სხვისგან ბევრს ნურას ველოდებითო.“`,

`„კმაყოფილება კაცის მომაკვდინებელი სენია.“`,

`„ქვეყანა იმით კი არ არის უბედური, რომ ღარიბია, არამედ იმით, რომ მცოდნე, გონებაგახსნილი, გულანთებული კაცები არა ჰყავს.“`,

`„შენ რომ ცუდკაცობდე, კაიკაცობაზედ სხვას მაინც ნუ გალანძღავ.“`,
]
button.addEventListener('click', ()=>{
    let random = Math.floor(Math.random()*advices.length)
    quote.innerHTML = `${advices[random]}`
    quoteCount++;
    adviceNum.textContent = `${quoteCount}`
})